/********************************************************************************************
*                           版权所有(C) 2015, 电信科学技术第五研究所
*                                 版权所有
*********************************************************************************************
*    文 件 名:       net_process.h
*    作者:           HuangFei
*    版本号:         v1.0
*    编译器:         arm-linux-gcc
*    生成日期:       2015-1-30
*    函数列表:
*********************************************************************************************
*    备注:            
*    修改历史:
                   1.日期: 2015-1-30
                     作者: HuangFei
                     修改内容: 新创建文件


*********************************************************************************************/


#ifndef __NET_PROCESS_H__
#define __NET_PROCESS_H__

#include "common.h"
#include "data_type.h"



extern void Init_NetEnviroment(PNetInfor pNetInfor);
extern void Init_NetComm(PtpClock *pPtpclock,NetComm *pNetComm);


#endif
